# Домашнее задание к работе 13
## Условие задачи
Составить программу, которая во введенной пользователем
строке подсчитывает, сколько слов имеют указанную
пользователем длину.
## 1. Алгоритм
### Алгоритм
. Начало алгоритма

2. Инициализация переменных:

input[] - массив для хранения введенной строки

target_length - искомая длина слова

count = 0 - счетчик найденных слов

in_word = 0 - флаг нахождения внутри слова (0 - вне слова, 1 - внутри слова)

current_length = 0 - длина текущего слова

3. Ввод данных:

Вывести "Введите строку: "

Считать строку с помощью fgets() в массив input

Удалить символ новой строки \n из конца строки

Вывести "Введите длину слова для поиска: "

Считать целое число в target_length

4. Проверка корректности данных:

ЕСЛИ target_length <= 0 ТОГДА:

Вывести сообщение об ошибке

Завершить программу

5. Обработка строки посимвольно:

ДЛЯ каждого символа input[i] от начала до конца строки (\0):

Случай A: Текущий символ - пробел

ЕСЛИ isspace(input[i]) ИСТИНА ТОГДА:

ЕСЛИ in_word == 1 ТОГДА (завершение слова):

ЕСЛИ current_length == target_length ТОГДА:

count = count + 1

in_word = 0

current_length = 0

Случай B: Текущий символ - не пробел (часть слова)

ИНАЧЕ:

in_word = 1

current_length = current_length + 1

6. Проверка последнего слова:

ЕСЛИ in_word == 1 И current_length == target_length ТОГДА:

count = count + 1

7. Вывод результата:

Вывести "Количество слов длиной X символов: Y"

Где X = target_length, Y = count

8. Конец алгоритма
## 2. Реализация программы

#include <stdio.h>

#include <string.h>

#include <ctype.h>

#include <locale.h>

#define MAX_LENGTH 1000

int main() {

    setlocale(LC_CTYPE, "RUS");

    char input[MAX_LENGTH];
    int target_length;
    int count = 0;
    int in_word = 0;
    int current_length = 0;

    // Ввод строки от пользователя
    printf("Введите строку: ");
    fgets(input, MAX_LENGTH, stdin);

    // Удаление символа новой строки, если он есть
    size_t len = strlen(input);
    if (len > 0 && input[len - 1] == '\n') {
        input[len - 1] = '\0';
    }

    // Ввод целевой длины слова
    printf("Введите длину слова для поиска: ");
    scanf("%d", &target_length);

    // Проверка корректности введенной длины
    if (target_length <= 0) {
        printf("Длина слова должна быть положительным числом.\n");
        return 1;
    }

    // Подсчет слов указанной длины
    for (int i = 0; input[i] != '\0'; i++) {
        if (isspace(input[i])) {
            // Если встретили пробел и были внутри слова
            if (in_word) {
                if (current_length == target_length) {
                    count++;
                }
                in_word = 0;
                current_length = 0;
            }
        }
        else {
            // Если символ не пробельный - это часть слова
            in_word = 1;
            current_length++;
        }
    }

    // Проверка последнего слова в строке
    if (in_word && current_length == target_length) {
        count++;
    }

    // Вывод результата
    printf("Количество слов длиной %d символов: %d\n", target_length, count);

    return 0;
    
}
## 3. Результаты работы программы

Введите строку: Всем привет, я Антон.

Введите длину слова для поиска: 1

Количество слов длиной 1 символов: 1

## 4. Информация о разработчике
Лычагин Антон бИЦ-252
